RhinoInside.Revit API Documentation
GeometryEncoder.ToGeometryObject Method
 Converts the specified Rhino.Geometry.GeometryBase to an equivalent of Autodesk.Revit.DB.GeometryObject.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.GeometryObject ToGeometryObject(
	this Rhino.Geometry.GeometryBase geombase
)
@staticmethod
def ToGeometryObject(
	geombase: Rhino.Geometry.GeometryBase
) -> Autodesk.Revit.DB.GeometryObject
Parameters
geombase
Type: Rhino.Geometry.GeometryBase
Rhino geometryBase to convert.
Return Value
Type: Autodesk.Revit.DB.GeometryObject
Revit geometryObject that is equivalent to the provided Rhino geometryBase.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.GeometryBase. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToGeometryObject(GeometryBase) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.GeometryObject revitGeomObj = rhinoGeom.ToGeometryObject();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_geomobj = rhino_geom.ToGeometryObject()    # type: DB.GeometryObject
 Using ToGeometryObject(GeometryBase) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.GeometryObject revitGeomObj = GeometryEncoder.ToGeometryObject(rhinoGeom);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_geomobj = GE.ToGeometryObject(rhino_geom)    # type: DB.GeometryObject
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace